In [10]:
import pandas as pd
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import json

from datetime import datetime

In [11]:
# Extract the data set from csv file: 
stock = "resources/all_stocks_5yr.csv"
allstock_df = pd.read_csv(stock)
#rename column for merge
allstock_df=allstock_df.rename(columns={"Name":"Symbol"})
allstock_df.head(10)

         date   open   high    low  close    volume Symbol
0  2013-02-08  15.07  15.12  14.63  14.75   8407500    AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000    AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000    AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500    AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900    AAL
5  2013-02-15  13.93  14.61  13.93  14.50  15628000    AAL
6  2013-02-19  14.33  14.56  14.08  14.26  11354400    AAL
7  2013-02-20  14.17  14.26  13.15  13.33  14725200    AAL
8  2013-02-21  13.62  13.95  12.90  13.37  11922100    AAL
9  2013-02-22  13.57  13.60  13.21  13.57   6071400    AAL

In [12]:
#load helper csv to add name and industry to original dataset
stockname="resources/stocks_list.csv"
stockname_df=pd.read_csv(stockname)
stockname_df=stockname_df[['Symbol','Name','Industry']]
stockname_df.head()

  Symbol                   Name                        Industry
0      A   Agilent Technologies  Life Sciences Tools & Services
1     AA                  Alcoa                 Metals & Mining
2    AAC       Ares Acquisition              Blank Check / SPAC
3   AACG  ATA Creativity Global   Diversified Consumer Services
4   AACI   Armada Acquisition I              Blank Check / SPAC

In [13]:
#merge 2 datasets
merged_df=pd.merge(allstock_df ,stockname_df, how='left', on='Symbol')
merged_df.head()

,date,open,high,low,close,volume,Symbol,Name,Industry
0,2013-02-08,15.07,15.12,14.63,14.75,8407500,AAL,American Airlines Group,Airlines
1,2013-02-11,14.89,15.01,14.26,14.46,8882000,AAL,American Airlines Group,Airlines
2,2013-02-12,14.45,14.51,14.10,14.27,8126000,AAL,American Airlines Group,Airlines
3,2013-02-13,14.30,14.94,14.25,14.66,10259500,AAL,American Airlines Group,Airlines
4,2013-02-14,14.94,14.96,13.16,13.99,31879900,AAL,American Airlines Group,Airlines

In [14]:
# narrow down into 1 year (2018) 

one_year_df = merged_df.loc[merged_df["date"] >= "2017-01-01"]
one_year_df

,date,open,high,low,close,volume,Symbol,Name,Industry
982,2017-01-03,47.28,47.340,46.135,46.30,6737752,AAL,American Airlines Group,Airlines
983,2017-01-04,46.63,47.435,46.350,46.70,5859604,AAL,American Airlines Group,Airlines
984,2017-01-05,46.52,46.930,45.610,45.89,6825316,AAL,American Airlines Group,Airlines
985,2017-01-06,45.85,46.720,45.470,46.21,7260197,AAL,American Airlines Group,Airlines
986,2017-01-09,46.01,47.340,45.780,47.08,4739142,AAL,American Airlines Group,Airlines
...,...,...,...,...,...,...,...,...,...
619035,2018-02-01,76.84,78.270,76.690,77.82,2982259,ZTS,Zoetis,Pharmaceuticals
619036,2018-02-02,77.53,78.120,76.730,76.78,2595187,ZTS,Zoetis,Pharmaceuticals
619037,2018-02-05,76.64,76.920,73.180,73.83,2962031,ZTS,Zoetis,Pharmaceuticals
619038,2018-02-06,72.74,74.560,72.130,73.27,4924323,ZTS,Zoetis,Pharmaceuticals
619039,2018-02-07,72.70,75.000,72.690,73.86,4534912,ZTS,Zoetis,Pharmaceuticals

In [15]:
one_year_df = one_year_df.reset_index(drop=True)
one_year_df

,date,open,high,low,close,volume,Symbol,Name,Industry
0,2017-01-03,47.28,47.340,46.135,46.30,6737752,AAL,American Airlines Group,Airlines
1,2017-01-04,46.63,47.435,46.350,46.70,5859604,AAL,American Airlines Group,Airlines
2,2017-01-05,46.52,46.930,45.610,45.89,6825316,AAL,American Airlines Group,Airlines
3,2017-01-06,45.85,46.720,45.470,46.21,7260197,AAL,American Airlines Group,Airlines
4,2017-01-09,46.01,47.340,45.780,47.08,4739142,AAL,American Airlines Group,Airlines
...,...,...,...,...,...,...,...,...,...
139157,2018-02-01,76.84,78.270,76.690,77.82,2982259,ZTS,Zoetis,Pharmaceuticals
139158,2018-02-02,77.53,78.120,76.730,76.78,2595187,ZTS,Zoetis,Pharmaceuticals
139159,2018-02-05,76.64,76.920,73.180,73.83,2962031,ZTS,Zoetis,Pharmaceuticals
139160,2018-02-06,72.74,74.560,72.130,73.27,4924323,ZTS,Zoetis,Pharmaceuticals
139161,2018-02-07,72.70,75.000,72.690,73.86,4534912,ZTS,Zoetis,Pharmaceuticals

In [16]:
quantity = one_year_df["Name"].unique()
quantity

array(['American Airlines Group', 'Apple', 'Advance Auto Parts', 'AbbVie',
       'AmerisourceBergen', 'Abbott Laboratories', 'Accenture', 'Adobe',
       'Analog Devices', 'Archer-Daniels-Midland Company',
       'Automatic Data Processing', 'Autodesk', 'Alliance Data Systems',
       'Ameren', 'American Electric Power Company', 'The AES Corporation',
       nan, 'Aflac', 'American International Group',
       'Apartment Investment & Management Company', 'Assurant',
       'Arthur J. Gallagher & Company', 'Akamai Technologies',
       'Albemarle', 'Align Technology', 'Alaska Air Group', 'Allegion',
       'The Allstate Corporation', 'Applied Materials',
       'Advanced Micro Devices', 'AMETEK', 'Amgen',
       'Affiliated Managers Group', 'Ameriprise Financial',
       'American Tower', 'Amazon.com', 'ANSYS', 'Anthem', 'Aon plc',
       'A. O. Smith', 'APA Corporation', 'Air Products & Chemicals',
       'Amphenol', 'Aptiv', 'Alexandria Real Estate Equities', 'Arconic',
       'Activision Blizzard', 'AvalonBay Communities', 'Broadcom',
       'Avery Dennison', 'American Water Works Company',
       'American Express Company', 'Acuity Brands', 'AutoZone',
       'Agilent Technologies', 'Bank of America', 'Baxter International',
       'The Boeing Company', 'Best Buy Co.',
       'Becton, Dickinson and Company', 'Franklin Resources',
       'Brown-Forman', 'Brighthouse Financial', 'Biogen',
       'Bank of New York Mellon', 'BlackRock', 'Ball Corporation',
       'Bristol-Myers Squibb Company', 'Berkshire Hathaway',
       'Boston Scientific', 'BorgWarner', 'Boston Properties',
       'Conagra Brands', 'Cardinal Health', 'Caterpillar',
       'Cboe Global Markets', 'Chubb', 'Crown Castle International',
       'Carnival', 'Cadence Design Systems', 'Cerner',
       'Citizens Financial Group', 'CF Industries Holdings',
       'Church & Dwight Company', 'Chesapeake Energy',
       'C.H. Robinson Worldwide', 'Charter Communications',
       'Cincinnati Financial', 'Cigna', 'The Clorox Company',
       'Colgate-Palmolive Company', 'Comerica', 'Comcast', 'CME Group',
       'Chipotle Mexican Grill', 'Cummins', 'CMS Energy', 'Centene',
       'CenterPoint Energy', 'Capital One Financial',
       'The Cooper Companies', 'ConocoPhillips', 'Costco Wholesale',
       'Coty Inc.', 'Campbell Soup Company', 'Salesforce.com',
       'Cisco Systems', 'CSX Corporation', 'Cintas',
       'Cognizant Technology Solutions', 'Citrix Systems', 'CVS Health',
       'Chevron', 'Citigroup', 'Delta Air Lines', 'Deere & Company',
       'Discover Financial Services', 'Quest Diagnostics',
       'Dollar General', 'D.R. Horton', 'Danaher', 'Discovery',
       'DISH Network', 'The Walt Disney Company', 'Digital Realty Trust',
       'Dollar Tree', 'Dover', 'Duke Realty', 'Darden Restaurants',
       'DTE Energy Company', 'Duke Energy', 'DaVita', 'Devon Energy',
       'DXC Technology Company', 'Dominion Energy', 'Electronic Arts',
       'eBay Inc.', 'Ecolab', 'Consolidated Edison', 'Equifax',
       'Edison International', 'The Estee Lauder Companies',
       'Eastman Chemical Company', 'Emerson Electric Company',
       'EOG Resources', 'Equinix', 'Equity Residential',
       'EQT Corporation', 'Essex Property Trust', 'Eversource Energy',
       'Eaton', 'Entergy', 'Edwards Lifesciences', 'Exelon',
       'Expeditors International of Washington', 'Expedia Group',
       'Extra Space Storage', 'Fastenal Company',
       'Fortune Brands Home & Security', 'Meta Platforms',
       'Freeport-McMoRan', 'FedEx', 'FirstEnergy', 'F5 Networks',
       'Fiserv', 'Fidelity National Information Services',
       'Fifth Third Bancorp', 'Fluor', 'Flowserve', 'Foot Locker',
       'FMC Corporation', 'Fox Corporation',
       'Federal Realty Investment Trust', 'TechnipFMC', 'Fortive',
       'Ford Motor Company', 'General Dynamics',
       'General Electric Company', 'Gilead Sciences', 'General Mills',
       'Corning', 'General Motors Company', 'Alphabet',
       'Genuine Parts Company', 'Global Payments', 'The Gap', 'Garmin',
       'The Goldman Sachs Group', 'The Goodyear Tire & Rubber Company',
       'W.W. Grainger', 'Halliburton Company', 'Hasbro',
       'Huntington Bancshares', 'Hanesbrands', 'HCA Healthcare',
       'HashiCorp', 'The Home Depot', 'Hess Corporation',
       'The Hartford Financial Services Group',
       'Huntington Ingalls Industries', 'Hilton Worldwide Holdings',
       'Harley-Davidson', 'Hologic', 'Honeywell International',
       'Hewlett-Packard Enterprise Company', 'HP Inc.',
       'Helmerich & Payne', 'H&R Block', 'Hormel Foods', 'Henry Schein',
       'Host Hotels & Resorts', 'The Hershey Company', 'Humana',
       'International Business Machines', 'Intercontinental Exchange',
       'IDEXX Laboratories', 'International Flavors & Fragrances',
       'Illumina', 'Incyte', 'Intel', 'Intuit',
       'The Interpublic Group of Companies',
       'International Paper Company', 'IQVIA Holdings', 'Iron Mountain',
       'Ingersoll Rand', 'Intuitive Surgical', 'Illinois Tool Works',
       'Gartner', 'Invesco', 'J.B. Hunt Transport Services',
       'Johnson Controls International', 'Johnson & Johnson',
       'Juniper Networks', 'JPMorgan Chase & Co.', 'Nordstrom', 'KeyCorp',
       'The Kraft Heinz Company', 'Kimco Realty', 'KLA Corporation',
       'Kimberly-Clark', 'Kinder Morgan', 'CarMax',
       'The Coca-Cola Company', 'The Kroger Company', "Kohl's",
       'Kellogg Company', 'Leggett & Platt', 'Lennar',
       'Laboratory Corporation of America Holdings', 'LKQ Corporation',
       'JX Luxventure', 'Eli Lilly and Company', 'Lockheed Martin',
       'Lincoln National', 'Alliant Energy', "Lowe's Companies",
       'Lam Research', 'Southwest Airlines Company',
       'LyondellBasell Industries NV', 'Loews',
       'Mid-America Apartment Communities', 'The Macerich Company',
       'Marriott International', 'Masco', 'Mattel', 'Mastercard',
       "McDonald's", 'Microchip Technology', 'McKesson', "Moody's",
       'Mondelez International', 'Medtronic plc.', 'MetLife',
       'MGM Resorts International', 'Mohawk Industries',
       'McCormick & Company', 'Martin Marietta Materials',
       'Marsh & McLennan Companies', '3M Company', 'Monster Beverage',
       'Monument Circle Acquisition', 'The Mosaic Company',
       'Altria Group', 'Marathon Petroleum', 'Merck & Co.',
       'Marathon Oil', 'Microsoft', 'Motorola Solutions',
       'Morgan Stanley', 'M&T Bank', 'Mettler-Toledo International',
       'Micron Technology', "Macy's", 'Navient',
       'Norwegian Cruise Line Holdings', 'Nasdaq', 'NextEra Energy',
       'Newmont', 'Netflix', 'NiSource', 'Nike, Inc.', 'Nielsen Holdings',
       'Northrop Grumman', 'NOV Inc.', 'NRG Energy', 'Norfolk Southern',
       'NetApp', 'Northern Trust', 'Nucor', 'NVIDIA', 'Newell Brands',
       'News Corporation', 'ONEOK', 'Omnicom Group', 'Oracle',
       "O'Reilly Automotive", 'Occidental Petroleum', 'Realty Income',
       'Paychex', "People's United Financial", 'PACCAR',
       'PG&E Corporation', 'Patterson Companies',
       'Public Service Enterprise Group', 'PepsiCo', 'Pfizer',
       'Principal Financial Group', 'The Progressive Corporation',
       'The Procter & Gamble Company', 'PulteGroup', 'Parker-Hannifin',
       'Packaging Corporation of America', 'PerkinElmer', 'Prologis',
       'Philip Morris International', 'The PNC Financial Services Group',
       'Pentair', 'Pinnacle West Capital', 'PPG Industries',
       'PPL Corporation', 'Perrigo Company', 'Prudential Financial',
       'Public Storage', 'Phillips 66', 'PVH Corp.', 'Quanta Services',
       'Pioneer Natural Resources Company', 'P10, Inc.',
       'PayPal Holdings', 'Qualcomm', 'Qorvo', 'Royal Caribbean Cruises',
       'Regeneron Pharmaceuticals', 'Regency Centers', 'Everest Re Group',
       'Regions Financial', 'Robert Half International',
       'Raymond James Financial', 'Ralph Lauren', 'ResMed',
       'Rockwell Automation', 'Roper Technologies', 'Ross Stores',
       'Range Resources', 'Republic Services', 'SBA Communications',
       'Starbucks', 'The Charles Schwab Corporation', 'Sealed Air',
       'The Sherwin-Williams Company', 'Signet Jewelers',
       'The J. M. Smucker Company', 'Schlumberger', 'SL Green Realty',
       'Snap-on', 'Synopsys', 'The Southern Company', 'S&P Global',
       'Simon Property Group', 'Stericycle', 'Sempra Energy',
       'State Street', 'Seagate Technology Holdings',
       'Constellation Brands', 'Skyworks Solutions',
       'Stanley Black & Decker', 'Synchrony Financial', 'Stryker',
       'Sysco', 'Molson Coors Beverage Company', 'TransDigm Group',
       'TE Connectivity', 'Target', 'The TJX Companies',
       'Thermo Fisher Scientific', 'Tapestry', 'TripAdvisor',
       'T. Rowe Price Group', 'The Travelers Companies',
       'Tractor Supply Company', 'Tyson Foods', 'Texas Instruments',
       'Textron', 'AT&T, Inc.', 'Under Armour',
       'United Airlines Holdings', 'UDR, Inc.',
       'Universal Health Services', 'Ulta Beauty', 'UnitedHealth Group',
       'Unum Group', 'Union Pacific', 'United Parcel Service',
       'United Rentals', 'U.S. Bancorp', 'VF Corporation',
       'Valero Energy', 'Vulcan Materials Company',
       'Vornado Realty Trust', 'Verisk Analytics', 'VeriSign',
       'Vertex Pharmaceuticals', 'Ventas', 'Verizon Communications',
       'Visa Inc.', 'Waters', 'Walgreens Boots Alliance',
       'Western Digital', 'WEC Energy Group', 'Wells Fargo & Company',
       'Whirlpool', 'The Williams Companies', 'Walmart',
       'Waste Management', 'WestRock Company',
       'The Western Union Company', 'Wynn Resorts',
       'Weyerhaeuser Company', 'Xcel Energy', 'XL Fleet', 'Exxon Mobil',
       'Dentsply Sirona', 'Xerox Holdings', 'Xylem', 'Yum! Brands',
       'Zimmer Biomet Holdings', 'Zions Bancorporation NA', 'Zoetis'],
      dtype=object)

In [17]:
#View all Industry in the orignal dataset to select which industry to focus on
one_year_df["Industry"].unique()

array(['Airlines', 'Technology Hardware, Storage & Periph...',
       'Specialty Retail', 'Biotechnology',
       'Health Care Providers & Services',
       'Health Care Equipment & Supplies', 'IT Services', 'Software',
       'Semiconductors & Semiconductor Equipment', 'Food Products',
       'Multi-Utilities', 'Electric Utilities',
       'Independent Power and Renewable Elect...', nan, 'Insurance',
       'Equity Real Estate Investment Trusts ...', 'Chemicals',
       'Building Products', 'Electrical Equipment', 'Capital Markets',
       'Internet & Direct Marketing Retail',
       'Oil, Gas & Consumable Fuels',
       'Electronic Equipment, Instruments & C...', 'Auto Components',
       'Aerospace & Defense', 'Entertainment', 'Containers & Packaging',
       'Water Utilities', 'Consumer Finance',
       'Life Sciences Tools & Services', 'Banks', 'Beverages',
       'Pharmaceuticals', 'Diversified Financial Services', 'Machinery',
       'Hotels, Restaurants & Leisure', 'Health Care Technology',
       'Household Products', 'Air Freight & Logistics', 'Media',
       'Food & Staples Retailing', 'Personal Products',
       'Communications Equipment', 'Road & Rail',
       'Commercial Services & Supplies', 'Multiline Retail',
       'Household Durables', 'Professional Services',
       'Trading Companies & Distributors', 'Interactive Media & Services',
       'Metals & Mining', 'Construction & Engineering',
       'Energy Equipment & Services', 'Automobiles',
       'Industrial Conglomerates', 'Distributors', 'Leisure Products',
       'Textiles, Apparel & Luxury Goods', 'Software-Infrastructure',
       'Diversified Consumer Services', 'Apparel Manufacturing',
       'Construction Materials', 'Blank Check / SPAC', 'Tobacco',
       'Diversified Telecommunication Services', 'Auto Parts'],
      dtype=object)

In [18]:
#Dataframe with Pharmaceutical industries into json file
pharm_df=one_year_df.loc[one_year_df["Industry"] == "Pharmaceuticals"]
pharm_df

,date,open,high,low,close,volume,Symbol,Name,Industry
19729,2017-01-03,58.78,59.68,58.58,59.45,10061749,BMY,Bristol-Myers Squibb Company,Pharmaceuticals
19730,2017-01-04,59.46,59.75,59.03,59.14,6703370,BMY,Bristol-Myers Squibb Company,Pharmaceuticals
19731,2017-01-05,59.39,60.42,59.31,60.13,8422274,BMY,Bristol-Myers Squibb Company,Pharmaceuticals
19732,2017-01-06,60.04,60.33,58.85,59.95,10104635,BMY,Bristol-Myers Squibb Company,Pharmaceuticals
19733,2017-01-09,59.75,59.92,59.65,59.73,5263011,BMY,Bristol-Myers Squibb Company,Pharmaceuticals
...,...,...,...,...,...,...,...,...,...
139157,2018-02-01,76.84,78.27,76.69,77.82,2982259,ZTS,Zoetis,Pharmaceuticals
139158,2018-02-02,77.53,78.12,76.73,76.78,2595187,ZTS,Zoetis,Pharmaceuticals
139159,2018-02-05,76.64,76.92,73.18,73.83,2962031,ZTS,Zoetis,Pharmaceuticals
139160,2018-02-06,72.74,74.56,72.13,73.27,4924323,ZTS,Zoetis,Pharmaceuticals
139161,2018-02-07,72.70,75.00,72.69,73.86,4534912,ZTS,Zoetis,Pharmaceuticals

In [19]:
#Dataframe with "Technology Hardware, Storage & Periph..." industries into json file
tech_df=one_year_df.loc[one_year_df["Industry"] == "Technology Hardware, Storage & Periph..."]
tech_df
#tech_df.to_json(r'jsonfiles/technology.json')

,date,open,high,low,close,volume,Symbol,Name,Industry
277,2017-01-03,115.80,116.3300,114.760,116.15,28781865,AAPL,Apple,"Technology Hardware, Storage & Periph..."
278,2017-01-04,115.85,116.5100,115.750,116.02,21118116,AAPL,Apple,"Technology Hardware, Storage & Periph..."
279,2017-01-05,115.92,116.8642,115.810,116.61,22193587,AAPL,Apple,"Technology Hardware, Storage & Periph..."
280,2017-01-06,116.78,118.1600,116.470,117.91,31751900,AAPL,Apple,"Technology Hardware, Storage & Periph..."
281,2017-01-09,117.95,119.4300,117.940,118.99,33561948,AAPL,Apple,"Technology Hardware, Storage & Periph..."
...,...,...,...,...,...,...,...,...,...
137772,2018-02-01,34.10,34.3300,32.560,32.75,8154921,XRX,Xerox Holdings,"Technology Hardware, Storage & Periph..."
137773,2018-02-02,32.51,32.5100,31.535,31.63,3526028,XRX,Xerox Holdings,"Technology Hardware, Storage & Periph..."
137774,2018-02-05,31.80,32.6800,31.380,31.38,4104575,XRX,Xerox Holdings,"Technology Hardware, Storage & Periph..."
137775,2018-02-06,30.94,31.5300,30.220,30.85,4431244,XRX,Xerox Holdings,"Technology Hardware, Storage & Periph..."
137776,2018-02-07,30.73,31.4050,30.730,31.18,2983504,XRX,Xerox Holdings,"Technology Hardware, Storage & Periph..."

In [20]:
#Dataframe with Banks industries into json file
banks_df=one_year_df.loc[one_year_df["Industry"] == "Banks"]
#banks_df.to_json(r'jsonfiles/finance.json')
banks_df

,date,open,high,low,close,volume,Symbol,Name,Industry
16110,2017-01-03,22.60,22.680,22.200,22.53,99298080,BAC,Bank of America,Banks
16111,2017-01-04,22.72,22.960,22.600,22.95,76875052,BAC,Bank of America,Banks
16112,2017-01-05,22.82,22.930,22.345,22.68,86826447,BAC,Bank of America,Banks
16113,2017-01-06,22.78,22.850,22.560,22.68,66281476,BAC,Bank of America,Banks
16114,2017-01-09,22.51,22.710,22.400,22.55,75901509,BAC,Bank of America,Banks
...,...,...,...,...,...,...,...,...,...
138880,2018-02-01,53.79,55.000,53.590,54.98,3542047,ZION,Zions Bancorporation NA,Banks
138881,2018-02-02,54.77,55.610,53.980,54.15,4533570,ZION,Zions Bancorporation NA,Banks
138882,2018-02-05,53.54,54.160,51.220,51.65,3305284,ZION,Zions Bancorporation NA,Banks
138883,2018-02-06,50.41,52.760,49.761,52.52,3682542,ZION,Zions Bancorporation NA,Banks
138884,2018-02-07,52.23,54.315,52.220,54.02,6427280,ZION,Zions Bancorporation NA,Banks

In [21]:
BanksQuantity = banks_df["Name"].nunique()
BanksQuantity

15

In [22]:
# convert 3 df into 3 csv files: 

pharm_df.to_csv("pharm.csv", index = False)

In [23]:
tech_df.to_csv("tech.csv", index = False)

In [24]:
banks_df.to_csv("bank.csv", index = False)

In [27]:
# manipulating and put into SQL database:

# connect to local database: 
connection = "postgres:Postgres@localhost:5432/stockPandas_db"
engine = create_engine(f'postgresql://{connection}')

# put df into sql database format:

#allstock_df.to_sql(name='stock_master', con=engine, if_exists='append', index=False)
banks_df.to_sql(name='stock_banks', con = engine,if_exists='append',index=False)
tech_df.to_sql(name='stock_tech', con = engine,if_exists='append',index=False)
pharm_df.to_sql(name='stock_pharm', con = engine,if_exists='append',index=False)